{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Neomodel\n",
    "\n",
    "Neomodel est un OGM (Object graph Mapping) python.\n",
    "\n",
    "La documentation est très bien faite https://neomodel.readthedocs.io"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Configuration d'accès"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neomodel import (config, db, StructuredNode, StructuredRel, StringProperty, IntegerProperty,\n",
    "    UniqueIdProperty, RelationshipTo, RelationshipFrom)\n",
    "\n",
    "config.DATABASE_URL = 'bolt://neo4j:neo4j@localhost:7687'\n",
    "config.AUTO_INSTALL_LABELS = True\n",
    "\n",
    "db.set_connection(config.DATABASE_URL)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "*Nettoyage de la base*"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([], ())"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.cypher_query('MATCH (n) DETACH DELETE n')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "   ## Définition du domaine"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Modèle de relation    \n",
    "class WorkIn(StructuredRel):\n",
    "    function = StringProperty()\n",
    "\n",
    "\n",
    "# Class personne\n",
    "class Person(StructuredNode):\n",
    "    # properties\n",
    "    name = StringProperty(unique_index=True, required=True)\n",
    "    age = IntegerProperty()\n",
    "\n",
    "    # relation simple\n",
    "    service = RelationshipTo('Service', 'MEMBER_OF')\n",
    "    \n",
    "    # relation simple avec modèle\n",
    "    projects = RelationshipTo('Project', 'WORK_IN', model=WorkIn)\n",
    "    \n",
    "    \n",
    "class Service(StructuredNode):\n",
    "    name = StringProperty(unique_index=True, required=True)\n",
    "    members = RelationshipFrom('Person','MEMBER_OF')\n",
    "\n",
    "    \n",
    "class Project(StructuredNode):\n",
    "    name = StringProperty(unique_index=True, required=True)\n",
    "    workers = RelationshipFrom('Person','WORK_IN',model=WorkIn)\n",
    "    \n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Installation des labels et des indexes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neomodel import install_labels\n",
    "install_labels(Person)\n",
    "install_labels(Project)\n",
    "install_labels(Service)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Person: {'name': 'Roxanne', 'age': None, 'id': 35}>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "roxanne = Person(name='Roxanne')\n",
    "roxanne.save()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Modification"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Person: {'name': 'Roxanne', 'age': 32, 'id': 35}>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "roxanne.age = 32\n",
    "roxanne.save()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Détection de doublon"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node(35) already exists with label `Person` and property `name` = 'Roxanne' <class 'neomodel.exceptions.UniqueProperty'>\n"
     ]
    }
   ],
   "source": [
    "try:\n",
    "    altRoxanne = Person(name='Roxanne')\n",
    "    altRoxanne.save()\n",
    "except Exception as e:\n",
    "    print(e, type(e))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Détection d'invalidité"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Attempting to deflate property 'age' on <Person: {'name': 'Roxanne', 'age': 'FOO', 'id': 35}> of class 'Person': invalid literal for int() with base 10: 'FOO' <class 'neomodel.exceptions.DeflateError'>\n"
     ]
    }
   ],
   "source": [
    "roxanne.age = 'FOO'\n",
    "try:\n",
    "    roxanne.save()\n",
    "except Exception as e:\n",
    "    print(e, type(e))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Suppression"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "roxanne.delete()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Import de lab2000"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json \n",
    "with open('data/lab2000.json','r') as f:\n",
    "    lab = json.load(f)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Import des projets"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Project: {'name': 'Alpha', 'id': 37}>]\n",
      "[<Project: {'name': 'Cymbal', 'id': 38}>]\n",
      "[<Project: {'name': 'Tigre', 'id': 34}>]\n",
      "[<Project: {'name': 'Csw2000', 'id': 47}>]\n",
      "[<Project: {'name': 'Gringalet', 'id': 49}>]\n"
     ]
    }
   ],
   "source": [
    "for project in lab['projects']:\n",
    "    print(Project.get_or_create({'name': project}))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Import des services"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Service: {'name': 'Electronique', 'id': 48}>]\n",
      "[<Service: {'name': 'Informatique', 'id': 0}>]\n",
      "[<Service: {'name': 'Optique', 'id': 1}>]\n",
      "[<Service: {'name': 'Mécanique', 'id': 2}>]\n"
     ]
    }
   ],
   "source": [
    "for service in lab['services']:\n",
    "    print(Service.get_or_create({'name': service}))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Création des relations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "for person in lab['persons']:\n",
    "    \n",
    "    servNode = Service.nodes.get(name=person['service'])\n",
    "\n",
    "    persNode = Person.get_or_create({'name': person['name']})[0]\n",
    "    persNode.service.connect(servNode)\n",
    "    \n",
    "    for project in person['projects']:\n",
    "        projNode = Project.nodes.get(name=project['name'])\n",
    "        persNode.projects.connect(projNode, {'function':project['function']})\n",
    "     \n",
    "    persNode.save()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Détection de violation sur les relations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'name': 'Electronique', 'id': 48}\n"
     ]
    }
   ],
   "source": [
    "sophie = Person.nodes.get(name='Sophie Laforest')\n",
    "print(sophie.service.get())\n",
    "\n",
    "#----Error ----\n",
    "try:\n",
    "    sophie.service.connect(Person(name='Foo'))\n",
    "except ValueError as ve:\n",
    "    assert str(ve) == 'Expected node of class Service'\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Requêtes Cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Class personne\n",
    "class Person(StructuredNode):\n",
    "    # properties\n",
    "    name = StringProperty(unique_index=True, required=True)\n",
    "    age = IntegerProperty()\n",
    "\n",
    "    # relation simple\n",
    "    service = RelationshipTo('Service', 'MEMBER_OF')\n",
    "    \n",
    "    # relation simple avec modèle\n",
    "    projects = RelationshipTo('Project', 'WORK_IN', model=WorkIn)\n",
    "    \n",
    "    \n",
    "    def find_service_members_in_project(self):\n",
    "        '''\n",
    "        Finds same service member workin in the same projects.\n",
    "        \n",
    "        Returns\n",
    "        -------\n",
    "        List\n",
    "            List of Person \n",
    "        '''\n",
    "        results, columns = self.cypher(\n",
    "            \"MATCH (a)-[:MEMBER_OF]->(s:Service) \\\n",
    "            WHERE id(a)={self} \\\n",
    "            MATCH (a)-[:WORK_IN]->(p:Project)<-[:WORK_IN]-(b:Person)-[:MEMBER_OF]->(s) \\\n",
    "            WHERE id(a) <> id(b) \\\n",
    "            RETURN b\")\n",
    "        return [self.inflate(row[0]) for row in results]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'name': 'Electronique', 'id': 48}\n",
      "[<Person: {'name': 'Darlene Herman', 'age': None, 'id': 9}>, <Person: {'name': 'Jeanette Desnoyers', 'age': None, 'id': 55}>, <Person: {'name': 'Josette Laforest', 'age': None, 'id': 15}>]\n",
      "{'name': 'Electronique', 'id': 48}\n",
      "{'name': 'Electronique', 'id': 48}\n",
      "{'name': 'Electronique', 'id': 48}\n"
     ]
    }
   ],
   "source": [
    "tracey = Person.nodes.get(name='Tracey Herman')\n",
    "print(tracey.service.get())\n",
    "\n",
    "members = tracey.find_service_members_in_project()\n",
    "\n",
    "print(members)\n",
    "\n",
    "for m in members:\n",
    "    print(m.service.get())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
